#include <iostream>
#include "complex.h"

int main() {
    setlocale(0, "rus");
    Complex x[3],rez;
    cout<<"Введите последовательно три комплексных числа\nв формате A+iB, либо A-iB,\n";
    cout<<"где A и B - действительные числа\n";
    for (int i=0; i<3; i++) cin>>x[i];
    cout<<"\n******************************************************\n";
    cout<<"Результат выражения\n(!("<<x[0]<<"*"<<x[2]<<"*<<"x[1]<<")/";
    cout<<x[1]<<"+"<<x[1]<<"-"<<x[2]<<"+"<<x[0]<<"/(!"<<x[1]<<"))/(-"<<x[1]<<"-"<<x[2]<<")/"<<x[0]<<"\n";
    rez = !(x[0]*x[2]*x[1]);
    rez= (rez/x[1]+x[1]-x[2]+x[0]/(!x[1]));
    rez= rez/(-x[1]-x[2])/x[0];
    cout<<"равен: "<<rez;
    return 0;
}